In [78]:
import pandas as pd
import numpy as np

In [12]:
data = pd.read_csv("data/mobile-sales-data.csv")
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [16]:
type(data)

pandas.core.frame.DataFrame

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [11]:
data.sample(5)

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
1    Spain  27.0  48000.0       Yes
3    Spain  38.0  61000.0        No
6    Spain   NaN  52000.0        No
4  Germany  40.0      NaN       Yes

In [14]:
data.shape

(10, 4)

In [15]:
data["Salary"]

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

In [17]:
data.iloc[:, 2]

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

In [18]:
c = data["Salary"]

In [19]:
c.min(), c.max(), c.median()

(48000.0, 83000.0, 61000.0)

In [20]:
data[5:8]

  Country   Age   Salary Purchased
5  France  35.0  58000.0       Yes
6   Spain   NaN  52000.0        No
7  France  48.0  79000.0       Yes

In [21]:
data.iloc[5:8, [0, 3]]

  Country Purchased
5  France       Yes
6   Spain        No
7  France       Yes

In [22]:
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [23]:
data.iloc[:, [0, 3]]

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [24]:
data[["Country", "Purchased"]]

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [32]:
data["Country"].apply(lambda s:s.upper())

0     FRANCE
1      SPAIN
2    GERMANY
3      SPAIN
4    GERMANY
5     FRANCE
6      SPAIN
7     FRANCE
8    GERMANY
9     FRANCE
Name: Country, dtype: object

In [33]:
data["COUNTRY"] = data["Country"].apply(lambda s:s.upper())
data

   Country   Age   Salary Purchased   SalAge  COUNTRY
0   France  44.0  72000.0        No  72044.0   FRANCE
1    Spain  27.0  48000.0       Yes  48027.0    SPAIN
2  Germany  30.0  54000.0        No  54030.0  GERMANY
3    Spain  38.0  61000.0        No  61038.0    SPAIN
4  Germany  40.0      NaN       Yes      NaN  GERMANY
5   France  35.0  58000.0       Yes  58035.0   FRANCE
6    Spain   NaN  52000.0        No      NaN    SPAIN
7   France  48.0  79000.0       Yes  79048.0   FRANCE
8  Germany  50.0  83000.0        No  83050.0  GERMANY
9   France  37.0  67000.0       Yes  67037.0   FRANCE

In [34]:
data["SalAge"] = data.apply(lambda row: row["Salary"] + row["Age"], 
                            axis = 1)
data

   Country   Age   Salary Purchased   SalAge  COUNTRY
0   France  44.0  72000.0        No  72044.0   FRANCE
1    Spain  27.0  48000.0       Yes  48027.0    SPAIN
2  Germany  30.0  54000.0        No  54030.0  GERMANY
3    Spain  38.0  61000.0        No  61038.0    SPAIN
4  Germany  40.0      NaN       Yes      NaN  GERMANY
5   France  35.0  58000.0       Yes  58035.0   FRANCE
6    Spain   NaN  52000.0        No      NaN    SPAIN
7   France  48.0  79000.0       Yes  79048.0   FRANCE
8  Germany  50.0  83000.0        No  83050.0  GERMANY
9   France  37.0  67000.0       Yes  67037.0   FRANCE

In [35]:
del(data["COUNTRY"])
del(data["SalAge"])
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [78]:
data.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [81]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [80]:
data.dropna(axis=1)

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [82]:
data.fillna(data.mean())

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [36]:
data["Age"].mean(), data["Salary"].mean()

(38.77777777777778, 63777.77777777778)

In [37]:
data.mean()

Age          38.777778
Salary    63777.777778
dtype: float64

In [38]:
data.fillna({"Age": 38.0,"Salary": 63777})

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63777.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [39]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [40]:
data["Age"].values

array([ 44.,  27.,  30.,  38.,  40.,  35.,  nan,  48.,  50.,  37.])

In [113]:
data["Purchased"].value_counts()

No     5
Yes    5
Name: Purchased, dtype: int64

In [115]:
data.median()

Age          38.388889
Salary    62388.888889
dtype: float64

In [116]:
data.groupby("Country").median()

          Age        Salary
Country
France   40.5  69500.000000
Germany  40.0  63777.777778
Spain    38.0  52000.000000

In [117]:
data.groupby("Country")["Age"].median()

Country
France     40.5
Germany    40.0
Spain      38.0
Name: Age, dtype: float64

In [120]:
data.groupby("Country")["Age"].agg([np.mean, np.median])

              mean  median
Country
France   41.000000    40.5
Germany  40.000000    40.0
Spain    34.592593    38.0

In [124]:
data.groupby("Country").agg({"Age": np.mean, "Salary": np.median})

               Age        Salary
Country
France   41.000000  69500.000000
Germany  40.000000  63777.777778
Spain    34.592593  52000.000000

In [136]:
data.groupby(["Country", "Purchased"]).mean()

                    Age   Salary
Country Purchased
France  No         44.0  72000.0
        Yes        40.0  68000.0
Germany No         40.0  68500.0
        Yes        40.0      NaN
Spain   No         38.0  56500.0
        Yes        27.0  48000.0

In [45]:
d1 = pd.DataFrame({"date": ["2016-03-23", "2015-08-15"]})
d1

         date
0  2016-03-23
1  2015-08-15

In [46]:
from datetime import datetime, date, time

In [47]:
datetime.strptime("2016-03-23", "%Y-%m-%d").date()

datetime.date(2016, 3, 23)

In [51]:
d1["date_type"] = d1.apply(lambda row: datetime.strptime(row["date"], "%Y-%m-%d"), axis = 1)
d1

         date  date_type
0  2016-03-23 2016-03-23
1  2015-08-15 2015-08-15

In [52]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
date         2 non-null object
date_type    2 non-null datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 112.0+ bytes

In [154]:
#data.columns = [c.lower() for c in data.columns]
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
data = data.fillna(data.median())

In [7]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

### Dummy variables to handle categorical variables

In [8]:
data2 =  pd.get_dummies(data, columns=["Country"])

In [9]:
del(data2["Purchased"])

In [10]:
pd.DataFrame(data2.values)

      0        1    2    3    4
0  44.0  72000.0  1.0  0.0  0.0
1  27.0  48000.0  0.0  0.0  1.0
2  30.0  54000.0  0.0  1.0  0.0
3  38.0  61000.0  0.0  0.0  1.0
4  40.0  61000.0  0.0  1.0  0.0
5  35.0  58000.0  1.0  0.0  0.0
6  38.0  52000.0  0.0  0.0  1.0
7  48.0  79000.0  1.0  0.0  0.0
8  50.0  83000.0  0.0  1.0  0.0
9  37.0  67000.0  1.0  0.0  0.0

### Normalize

In [12]:
from sklearn.preprocessing import StandardScaler

In [13]:
ss = StandardScaler()
data2_std = ss.fit_transform(data2.values)

In [14]:
pd.DataFrame(data2_std, columns = data2.columns)

        Age    Salary  Country_France  Country_Germany  Country_Spain
0  0.769734  0.772568        1.224745        -0.654654      -0.654654
1 -1.699225 -1.408800       -0.816497        -0.654654       1.527525
2 -1.263526 -0.863458       -0.816497         1.527525      -0.654654
3 -0.101663 -0.227226       -0.816497        -0.654654       1.527525
4  0.188803 -0.227226       -0.816497         1.527525      -0.654654
5 -0.537362 -0.499897        1.224745        -0.654654      -0.654654
6 -0.101663 -1.045239       -0.816497        -0.654654       1.527525
7  1.350666  1.408800        1.224745        -0.654654      -0.654654
8  1.641132  1.772361       -0.816497         1.527525      -0.654654
9 -0.246896  0.318116        1.224745        -0.654654      -0.654654

### Sort

In [24]:
data.sort_values("Salary", ascending=False)

   Country   Age   Salary Purchased
8  Germany  50.0  83000.0        No
7   France  48.0  79000.0       Yes
0   France  44.0  72000.0        No
9   France  37.0  67000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
2  Germany  30.0  54000.0        No
6    Spain  38.0  52000.0        No
1    Spain  27.0  48000.0       Yes

### Filter

In [54]:
data = pd.read_csv("data/mobile-sales-data.csv")
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [27]:
data[data["Country"] == "Spain"]

  Country   Age   Salary Purchased
1   Spain  27.0  48000.0       Yes
3   Spain  38.0  61000.0        No
6   Spain   NaN  52000.0        No

In [60]:
data.query("Country == 'Spain'")

  Country   Age   Salary Purchased
1   Spain  27.0  48000.0       Yes
3   Spain  38.0  61000.0        No
6   Spain   NaN  52000.0        No

### Joining Data

In [62]:
movies = pd.read_csv("data/ml-latest-small/movies.csv")
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [65]:
movies = movies.set_index("movieId")
movies.head()

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy

In [63]:
ratings = pd.read_csv("data/ml-latest-small/ratings.csv")
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [69]:
ratings = ratings.set_index("movieId")
ratings.head()

         userId  rating   timestamp
movieId
31            1     2.5  1260759144
1029          1     3.0  1260759179
1061          1     3.0  1260759182
1129          1     2.0  1260759185
1172          1     4.0  1260759205

In [73]:
movies.join(ratings).head()

,title,genres,userId,rating,timestamp
movieId,,,,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7.0,3.0,8.518667e+08
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,9.0,4.0,9.386292e+08
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,13.0,5.0,1.331380e+09
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15.0,2.0,9.979383e+08
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,19.0,3.0,8.551901e+08

In [84]:
grouped = movies.join(ratings).groupby(["movieId", "title"])
grouped.rating.agg([len, np.mean]).query("len >= 100").sort_values("mean", ascending = False)

                                                              len      mean
movieId title
858     Godfather, The (1972)                               200.0  4.487500
318     Shawshank Redemption, The (1994)                    311.0  4.487138
1221    Godfather: Part II, The (1974)                      135.0  4.385185
50      Usual Suspects, The (1995)                          201.0  4.370647
527     Schindler's List (1993)                             244.0  4.303279
1193    One Flew Over the Cuckoo's Nest (1975)              144.0  4.256944
608     Fargo (1996)                                        224.0  4.256696
296     Pulp Fiction (1994)                                 324.0  4.256173
2858    American Beauty (1999)                              220.0  4.236364
58559   Dark Knight, The (2008)                             121.0  4.235537
912     Casablanca (1942)                                   117.0  4.235043
1196    Star Wars: Episode V - The Empire Strikes Back ...  234.0  4.232906
4226    Memento (2000)                                      132.0  4.227273
111     Taxi Driver (1976)                                  118.0  4.224576
1136    Monty Python and the Holy Grail (1975)              145.0  4.224138
260     Star Wars: Episode IV - A New Hope (1977)           291.0  4.221649
750     Dr. Strangelove or: How I Learned to Stop Worry...  105.0  4.209524
1197    Princess Bride, The (1987)                          163.0  4.208589
1213    Goodfellas (1990)                                   131.0  4.202290
1198    Raiders of the Lost Ark (Indiana Jones and the ...  220.0  4.193182
2571    Matrix, The (1999)                                  259.0  4.183398
4993    Lord of the Rings: The Fellowship of the Ring, ...  200.0  4.182500
2959    Fight Club (1999)                                   202.0  4.178218
1089    Reservoir Dogs (1992)                               132.0  4.162879
1225    Amadeus (1984)                                      100.0  4.155000
778     Trainspotting (1996)                                124.0  4.141129
1704    Good Will Hunting (1997)                            157.0  4.140127
1208    Apocalypse Now (1979)                               112.0  4.138393
593     Silence of the Lambs, The (1991)                    304.0  4.138158
7153    Lord of the Rings: The Return of the King, The ...  176.0  4.127841
...                                                           ...       ...
500     Mrs. Doubtfire (1993)                               153.0  3.467320
10      GoldenEye (1995)                                    122.0  3.450820
165     Die Hard: With a Vengeance (1995)                   142.0  3.443662
339     While You Were Sleeping (1995)                      101.0  3.440594
2174    Beetlejuice (1988)                                  104.0  3.437500
539     Sleepless in Seattle (1993)                         125.0  3.428000
2       Jumanji (1995)                                      107.0  3.401869
592     Batman (1989)                                       196.0  3.397959
253     Interview with the Vampire: The Vampire Chronic...  125.0  3.396000
1517    Austin Powers: International Man of Mystery (1997)  107.0  3.378505
316     Stargate (1994)                                     145.0  3.368966
597     Pretty Woman (1990)                                 147.0  3.360544
329     Star Trek: Generations (1994)                       114.0  3.350877
288     Natural Born Killers (1994)                         107.0  3.336449
1721    Titanic (1997)                                      164.0  3.332317
587     Ghost (1990)                                        126.0  3.325397
292     Outbreak (1995)                                     110.0  3.309091
2706    American Pie (1999)                                 111.0  3.297297
2683    Austin Powers: The Spy Who Shagged Me (1999)        112.0  3.272321
736     Twister (1996)                                      150.0  3.250000
2628    Star Wars: Episode I - The Phantom Menace (1999)    138.0  3.199275
586     Home Alone (1990)                                   129.0  3.112403
231     Dumb & Dumber (Dumb and Dumber) (1994)              158.0  3.110759
185     Net, The (1995)                                     102.0  3.102941
434     Cliffhanger (1993)                                  106.0  3.084906
367     Mask, The (1994)                                    157.0  3.070064
1917    Armageddon (1998)                                   113.0  3.044248
344     Ace Ventura: Pet Detective (1994)                   175.0  2.871429
153     Batman Forever (1995)                               129.0  2.782946
208     Waterworld (1995)                                   113.0  2.752212

[151 rows x 2 columns]

# What we have learned?
- load data from a file to DataFrame
- create a DataFrame from python list/map
- how to pass column names to dataframe
- select columns using column name
- select columns using row indexes
- handle NaN using inputation
- drop NaN from data
- aggregate data on single and multiple columns
- aggregate by multiple fields
- apply function on single column and entire row
- sort dataframe
- filter
- Joining dataframes